tutorials/incompressible/pimpleDyMSolver/oscillatingInletACMI2D/constant/dynamicMeshDict
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   solidBodyMotionFvMesh;

motionSolverLibs ( "libfvMotionSolvers.so" );

solidBodyMotionFvMeshCoeffs
{
    cellZone        inletChannel;

    solidBodyMotionFunction  oscillatingLinearMotion;

    oscillatingLinearMotionCoeffs
    {
        amplitude       (0 0.5 0);
        omega           3.14; // rad/s  (.5 rps)
    }
}


// ************************************************************************* //
