tutorials/incompressible/pimpleDyMSolver/oscillatingInletACMI2D/0.org/p
/*---------------------------------------------------------------------------*
Caelus 7.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
    couple1
    {
        type            zeroGradient;
    }
    couple2
    {
        type            zeroGradient;
    }
    defaultFaces
    {
        type            empty;
    }
    ACMI1_blockage
    {
        type            zeroGradient;
    }
    ACMI1_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }
    ACMI2_blockage
    {
        type            zeroGradient;
    }
    ACMI2_couple
    {
        type            cyclicACMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
